import { useEffect, useState } from "react";
import Navbar from "../component/Navbar";
import { BrowserRouter, Routes, Route } from "react-router-dom";
import axios from "axios";
import Footer from "../component/Footer";
import Card from "../component/Card";
import CardNews from "../component/CardNews";
import { DataResponse } from "../types/response";
import { getFootballData } from "../services/api";

function Home() {
  const [data, setData] = useState<DataResponse>();

  const fetchData = async () => {
    const { data } = await getFootballData();

    if (data) {
      setData(data);
    }
  };

  useEffect(() => {
    if (!data) {
      fetchData();
    }
    console.log(data);
  }, [data]);

  let news = [
    {
      title: "สรุป 16 ทีมสุดท้าย ฟุตบอลโลก 2022 : ใครเข้ารอบ? ใครเจอใคร?",
      image:
        "https://assets.goal.com/v3/assets/bltcc7a7ffd2fbf71f5/bltd2b7d37642168ae4/63867f4f784b5c4e43f8368e/goal---web-four-way-split--975f23b0-34e1-4cec-b444-70d3f11194f0.jpeg?quality=80&format=pjpg&auto=webp&width=1000",
      detail:
        "“เซเลเซา” ชุดนี้มีแนวรับที่แข็งแกร่ง ด้วยสองเซ็นเตอร์แบ็กรูปร่างสูงใหญ่อย่าง ติอาโก้ ซิลวา กับ มาร์ควินญอส ร่วมด้วยฟูลแบ็กที่คอยช่วยเกมรับและการครองบอล ขณะที่ในแผงมิดฟิลด์ก็มีกองกลางตัวรับที่หลายคนยกย่องว่า เป็นตัวท็อปของโลกอย่าง คาเซมิโร่ และทั้งกองกลางกับกองหน้า ต่างตื่นตัวและพร้อมเล่นเพรสซิ่งสูงอย่างดุดัน เมื่อเสียบอลก็พร้อมไปแย่งคืนอย่างรวดเร็ว เปิดโอกาสให้กองหน้ามีโอกาสลุ้นประตูมากขึ้น โดยเฉพาะอย่างยิ่ง ถ้าแย่งบอลคืนได้ในพื้นที่ของฝ่ายตรงข้าม",
      link: "https://www.goal.com/th/ข่าว/สรุป-16-ทีมสุดท้าย-ฟุตบอลโลก-2022--ใครเข้ารอบ-ใครเจอใคร/blt43b8c9d7cf6e06a9",
    },
    {
      title: "เส้นทางสู่ความฝัน : 'แซมบ้า' สมราคาเต็ง 1 ไม่สวยงาม แต่แกร่งพอ",
      image:
        "https://cms.dmpcdn.com/sportarticle/2022/11/30/613c3df0-7061-11ed-aa77-91c7a79d7e1d_original.jpg",
      detail:
        "“เซเลเซา” ชุดนี้มีแนวรับที่แข็งแกร่ง ด้วยสองเซ็นเตอร์แบ็กรูปร่างสูงใหญ่อย่าง ติอาโก้ ซิลวา กับ มาร์ควินญอส ร่วมด้วยฟูลแบ็กที่คอยช่วยเกมรับและการครองบอล ขณะที่ในแผงมิดฟิลด์ก็มีกองกลางตัวรับที่หลายคนยกย่องว่า เป็นตัวท็อปของโลกอย่าง คาเซมิโร่ และทั้งกองกลางกับกองหน้า ต่างตื่นตัวและพร้อมเล่นเพรสซิ่งสูงอย่างดุดัน เมื่อเสียบอลก็พร้อมไปแย่งคืนอย่างรวดเร็ว เปิดโอกาสให้กองหน้ามีโอกาสลุ้นประตูมากขึ้น โดยเฉพาะอย่างยิ่ง ถ้าแย่งบอลคืนได้ในพื้นที่ของฝ่ายตรงข้าม",
      link: "",
    },
    {
      title: "ข่าวบอลโลก 3",
      image:
        "https://cms.dmpcdn.com/sportarticle/2022/11/28/127b92d0-6f3d-11ed-951d-fddfc23e5db0_webp_original.webp",
      detail:
        "“เซเลเซา” ชุดนี้มีแนวรับที่แข็งแกร่ง ด้วยสองเซ็นเตอร์แบ็กรูปร่างสูงใหญ่อย่าง ติอาโก้ ซิลวา กับ มาร์ควินญอส ร่วมด้วยฟูลแบ็กที่คอยช่วยเกมรับและการครองบอล ขณะที่ในแผงมิดฟิลด์ก็มีกองกลางตัวรับที่หลายคนยกย่องว่า เป็นตัวท็อปของโลกอย่าง คาเซมิโร่ และทั้งกองกลางกับกองหน้า ต่างตื่นตัวและพร้อมเล่นเพรสซิ่งสูงอย่างดุดัน เมื่อเสียบอลก็พร้อมไปแย่งคืนอย่างรวดเร็ว เปิดโอกาสให้กองหน้ามีโอกาสลุ้นประตูมากขึ้น โดยเฉพาะอย่างยิ่ง ถ้าแย่งบอลคืนได้ในพื้นที่ของฝ่ายตรงข้าม",
      link: "",
    },
    {
      title: "ข่าวบอลโลก 4",
      image:
        "https://cms.dmpcdn.com/sportarticle/2022/11/28/2d16cab0-6f3d-11ed-b368-49c4817e1ba4_webp_original.webp",
      detail:
        "“เซเลเซา” ชุดนี้มีแนวรับที่แข็งแกร่ง ด้วยสองเซ็นเตอร์แบ็กรูปร่างสูงใหญ่อย่าง ติอาโก้ ซิลวา กับ มาร์ควินญอส ร่วมด้วยฟูลแบ็กที่คอยช่วยเกมรับและการครองบอล ขณะที่ในแผงมิดฟิลด์ก็มีกองกลางตัวรับที่หลายคนยกย่องว่า เป็นตัวท็อปของโลกอย่าง คาเซมิโร่ และทั้งกองกลางกับกองหน้า ต่างตื่นตัวและพร้อมเล่นเพรสซิ่งสูงอย่างดุดัน เมื่อเสียบอลก็พร้อมไปแย่งคืนอย่างรวดเร็ว เปิดโอกาสให้กองหน้ามีโอกาสลุ้นประตูมากขึ้น โดยเฉพาะอย่างยิ่ง ถ้าแย่งบอลคืนได้ในพื้นที่ของฝ่ายตรงข้าม",
      link: "",
    },
  ];

  return (
    <div className="App">
      <div className="bg-gray-200 ">
        {news.map((item) => (
          <CardNews
            title={item.title}
            image={item.image}
            detail={item.detail}
            link={item.link}
          />
        ))}
      </div>

      <Footer />
    </div>
  );
}

export default Home;
